{
    "projects" : [
    {
        "id": 1,
        "type": "public",
        "name": "This Site",
        "description": "This site is moving into the realm of serverless and JAM concepts. It uses vue-router for navigation and axios to load JSON files containing the data for the various Vue components (like this list). It also calls an offsite API to persist any contact in a MySql database and send a copy to my Gmail.",
        "link": "https://github.com/FullStackDev-UK/FullStackDev-UK.github.io",
        "created_at": "2019-04-16 23:00:02",
        "updated_at": "2019-04-16 23:00:02"
    },
    {
        "id": 2,
        "type": "public",
        "name": "Laravel58",
        "description": "This is a RESTful API for a single noun. It's intended to build up feature-by-feature on separate branches, so I can (in theory) pull in a branch containing roughly what I feel is a good starting point for a given project type",
        "link": "https://github.com/FullStackDev-UK/laravel58",
        "created_at": "2019-04-16 23:00:02",
        "updated_at": "2019-04-16 23:00:02"
    },
    {
        "id": 3,
        "type": "public",
        "name": "Mapping",
        "description": "Using MapBox and LeafletJS I'm moving a location-service-heavy app away from my current use of Google Maps API and re-exploring location services from a non-Google perspective in the process",
        "link": "https://github.com/FullStackDev-UK/mapping",
        "created_at": "2019-04-16 23:00:01",
        "updated_at": "2019-04-16 23:00:01"
    },
    {
        "id": 4,
        "type": "public",
        "name": "Charting",
        "description": "Graphs, charts and all things plotty. Currently plots points from either local JSON or PHP, but can easily be altered to consume JSON from API endpoint(s), updating at regular intervals. Useful for metrics dashboards.",
        "link": "https://github.com/FullStackDev-UK/charting",
        "created_at": "2019-04-16 23:00:01",
        "updated_at": "2019-04-16 23:00:01"
    },
    {
        "id": 5,
        "type": "private",
        "name": "PIoT",
        "description": "PIoT is an Internet-of-Things project based on the Raspberry Pi's GPIO pins. It uses rudimentary Python & PHP. Early in development, but functional. Backburner stuff.",
        "link": "#",
        "created_at": "2019-04-16 23:00:02",
        "updated_at": "2019-04-16 23:00:02"
    },
    {
        "id": 6,
        "type": "private",
        "name": "EBook Project",
        "description": "The eBook project is an ongoing effort to create a basic open-source e-book template that will satisfy the minimum requirements of the major publishing platforms. Aiming to be a free and simple tool allowing anyone to generate an ebook from their content with minimal effort.",
        "link": "#",
        "created_at": "2019-04-16 23:00:01",
        "updated_at": "2019-04-16 23:00:01"
    },
    {
        "id": 7,
        "type": "private",
        "name": "Handy snippets",
        "description": "Handy snippets for PHP, JavaScript, Bash, SQL, HTML, CSS and various tools. Only private until it's cleaned up, even vaguely structured and presentable to the World",
        "link": "#",
        "created_at": "2019-04-16 23:00:04",
        "updated_at": "2019-04-16 23:00:04"
    }
    ]
}
